#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.local_file.file_user_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_user_prompt: Read complete after 0s [id=da39a3ee5e6b4b0d3255bfef95601890afd80709][0m
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=da39a3ee5e6b4b0d3255bfef95601890afd80709][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/vdnlytcs-dev-uai001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mazapi_resource.subnet_function: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/WebAppSubnet][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_4o: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/deployments/gpt-4o][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/14238db2-02e1-6f8a-2574-7d7773cdc7b2][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/6964e07d-6402-98d5-0351-429b38049f86][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/5ba66195-4309-1f5e-819e-b4c740edc2a7][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aoai001-account-pe][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-kv001-vault-pe][0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001|applicationLogs-0][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001|applicationLogs-0][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T10:00:46Z][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T10:14:14Z][0m
[0m[1mmodule.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/ee52f2a8-8cd7-c34f-3920-e4b9b5e73e1a][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-file-pe][0m
[0m[1mmodule.azure_ai_generic.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.azure_ai_speech.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/980b45af-f3f5-713b-309f-43e2c544d357][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-queue-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-blob-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-table-pe][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001][0m
[0m[1mmodule.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001|applicationLogs-0][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.azure_ai_speech.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-ais001-account-pe][0m
[0m[1mmodule.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_cognitive_services_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001/providers/Microsoft.Authorization/roleAssignments/4209095a-46f0-616f-794d-1c449443b683][0m
[0m[1mmodule.azure_ai_generic.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aig001-account-pe][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_cognitive_services_openai_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/b0828593-ed2c-1177-7de8-5deb8ef34f45][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_reader: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-videos/providers/Microsoft.Authorization/roleAssignments/38e144a1-34b1-4327-88ba-488a27285ef7][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-analysis/providers/Microsoft.Authorization/roleAssignments/76f548bf-ce5c-0324-3521-13d566f09321][0m
[0m[1mazurerm_linux_function_app.linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001][0m
[0m[1mmodule.azure_ai_speech.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001|applicationLogs-0][0m
[0m[1mmodule.azure_ai_generic.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001|applicationLogs-0][0m
[0m[1mmodule.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T10:01:48Z][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["results-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/results-newsvideos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["upload-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/upload-newsvideos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-analysis"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-analysis][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-videos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-videos][0m
[0m[1mmodule.azure_ai_generic.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T10:01:52Z][0m
[0m[1mmodule.azure_ai_speech.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T15:11:38Z][0m
[0m[1mazurerm_private_endpoint.linux_function_app_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-app001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_function_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_function_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
    }

[1m  # azurerm_linux_function_app.linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_linux_function_app" "linux_function_app" {
      [33m~[0m[0m app_settings                                   = {
          [32m+[0m[0m "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
            [90m# (20 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
        name                                           = "vdnlytcs-dev-app001"
        tags                                           = {
            "workload" = "video-analytics"
        }
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_function_app" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_role_assignment.ai_speech_roleassignment_cognitive_services_openai_user[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "ai_speech_roleassignment_cognitive_services_openai_user" {
      [32m+[0m[0m description                      = "Required for accessing the open ai service from the ai service and submit completion API calls."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "550c9def-dcc1-45e7-b7ba-f8b8a1695e3e"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Cognitive Services OpenAI User"
      [32m+[0m[0m scope                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_contributor[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "ai_speech_roleassignment_storage_blob_data_contributor" {
      [32m+[0m[0m description                      = "Required for writing to the storage account from the ai service."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "550c9def-dcc1-45e7-b7ba-f8b8a1695e3e"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-analysis"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_reader[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "ai_speech_roleassignment_storage_blob_data_reader" {
      [32m+[0m[0m description                      = "Required for reading from the storage account from the ai service."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "550c9def-dcc1-45e7-b7ba-f8b8a1695e3e"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Reader"
      [32m+[0m[0m scope                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-videos"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001"
        name                    = "vdnlytcs-dev-aig001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001"
        name                    = "vdnlytcs-dev-ais001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001"
        name                    = "vdnlytcs-dev-aoai001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 3 to add, 5 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>